app/controllers/choppies_controller.rb

  def index
    @choppies = Choppy.all
---
SELECT "choppies".* FROM "choppies"

  def create
    @choppy = Choppy.find_by_actual_url(params[:choppy][:actual_url])
    @choppy = Choppy.new(choppy_params)

    begin
      choppy_key = SecureRandom.hex(KEY_LENGTH)
    end while Choppy.exists?(shortened_url: choppy_key)

    @choppy.shortened_url = choppy_key
    @choppy.http_status = 301

    respond_to do |format|
      if @choppy.save
---
SELECT  "choppies".* FROM "choppies" WHERE "choppies"."actual_url" = ? LIMIT 1  [["actual_url", "https://www.youtube.com/watch?v=u_qnao1uFoQ"]]
SELECT  1 AS one FROM "choppies" WHERE "choppies"."shortened_url" = ? LIMIT 1  [["shortened_url", "0c39c0"]]
INSERT INTO "choppies" ("actual_url", "shortened_url", "http_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def redirect
    @choppy = Choppy.where(shortened_url: params[:link]).first || not_found
    @choppy.update_attributes(updated_at: Time.now)
---
SELECT  "choppies".* FROM "choppies" WHERE "choppies"."shortened_url" = ?  ORDER BY "choppies"."id" ASC LIMIT 1  [["shortened_url", "91ee22"]]
UPDATE "choppies" SET "updated_at" = ? WHERE "choppies"."id" = ?  [["updated_at", "2015-12-24 21:21:42.036728"], ["id", 2]]

  def destroy
    @choppy.destroy
---
DELETE FROM "choppies" WHERE "choppies"."id" = ?  [["id", 1]]

    def set_choppy
      @choppy = Choppy.find(params[:id])
---
SELECT  "choppies".* FROM "choppies" WHERE "choppies"."id" = ? LIMIT 1  [["id", 1]]